{literal}
{
  "templates": [
    {
      "name": "大額捐款人感謝信",
      "org": "網絡行動科技",
      "role": "募款策畫者",
      "tone": "故事",
      "content": "大額捐款人在捐款人中數量偏少，卻因為大額的捐館能夠給予組織極大的力量推行改革，身分非常特別。\n最近進行了重大捐助的主要捐贈者打造一封個人化的感謝信，表達感激之情，並強調他們的支持將為組織帶來轉變性的成果！\n希望能夠強調其獨特性及重要性，並信中要簡潔條列完成幾樣捐款帶來的轉變，在結尾處邀請捐款人持續捐款。總共500字內。"
    },
    {
      "name": "示範範本",
      "org": "網絡行動科技",
      "role": "帳務人員",
      "tone": "誠懇而專業",
      "content": "組織簡介：「原生動物保育協會」致力於為台灣的原生種動物提供保護與推動修法。我們最大的幸福，就是再度讓這片土地的動物們安心且自由的在廣闊的天空下生活。協會主要推動包括棲地保護、野生動物保育、並積極展開教育推廣，對孩子、家長、老師、企業進行教育宣導，讓這個議題盡量種下一些小小的種子，然後慢慢開花結果。\n訂單編號OOO、開始捐款日期YYYY-MM-DD、訂單金額$OOO，捐款人來電提出需要暫停此筆訂單的後續扣款。請寫一封個人email，讓捐款人確認以上訊息無誤後回覆給我們，願意的話也可以進一步告訴我們停止捐款的原因，我們將在收到回覆後再進行此訂單的修改。"
    }
  ]
}
{/literal}
