{literal}
{
  "templates": [
    {
      "name": "生日捐電子報信件",
      "org": "網絡行動科技",
      "role": "募款策畫者",
      "tone": "口語敘事",
      "content": "生日捐：一種籌款模式，讓個人或小團體為自己支持的非營利組織募款。參與者利用自己的社交網絡，透過線上平台或活動籌款。這種方式有效利用個人聯繫擴大影響力，使募款更具規模和範圍。（例如：我生日快到時，請同事朋友不用送生日禮物給我，而是提供我的「個人募款頁」邀請他們捐款給我推薦的NPO，這就是一種生日捐募款。）\n如何進行：捐款人可以向組織提出申請意願，讓組織協助建立「個人募款頁」。由支持者選擇要放哪些照片、編寫文案邀請自己的朋友將生日祝福轉化為捐款、設定募款目標金額，用個人化的募款頁面說明為什麼要請大家捐款給您的組織。建立後，捐款人就可以自行宣傳，把連結給朋友，邀請對方捐款。透過個人影響力，將議題關注度推出同溫層\n請依照上方資訊，寫出一封特別的信件：\n先祝賀捐款人生日快樂，感謝捐款人。後簡述生日捐的運作方式，並告訴捐款人如何進行，結尾邀請捐款人藉著特別的日子發起「生日捐」募款活動"
    },
    {
      "name": "示範範本",
      "org": "網絡行動科技",
      "role": "活動統籌者",
      "tone": "故事",
      "content": "請幫忙寫一篇特別的年末感謝信，感謝支持者這一年的照顧\n並且簡短報告今年組織達成了幾大項目標，然後說要分享今年的年度報告，都是因為有捐款人才能達成這樣的結果等等"
    },
    {
      "name": "示範範本",
      "org": "網絡行動科技",
      "role": "非營利組織理事長",
      "tone": "友善而細膩",
      "content": "組織簡介：「光明未來」在台灣與地方社區、政府和其他組織密切合作，共同為這些孩子提供教育資源。我們的服務包括提供學習用品、教育輔導、生活技能培訓，並推動社區的教育意識。我們堅信，教育是改變生命、創造光明未來的最重要工具。讓我們一起努力，為這些失學的孩子重新點燃學習的希望，引領他們走向光明的未來。\n\n請幫組織撰寫800字以內的電子報文案，感謝捐款人的支持，簡述組織去年度的具體工作成果，邀請捐款人點擊電子報中的連結以協會的年度工作報告，最後邀請捐款人對組織的工作成果給予建議回饋。"
    }
  ]
}
{/literal}
