ACH Bank_verification_12,
0,0：成功新增或取消授權扣款
1,1：印鑑不符
2,2：無此帳號
3,3：委繳戶統一編號不符
4,4：已核印成功在案
5,5：原交易不存在
6,6：電子資料與授權書內容不符
7,7：帳戶已結清
8,8：印鑑不清
9,9：其他
A,A：未收到授權書
B,B：用戶號碼錯誤
C,C：靜止戶
D,D：未收到聲明書
E,E：授權書資料不全
F,F：警示戶
G,G：本帳戶不適用授權扣繳
H,H：已於他行授權扣款
I,I：該用戶已死亡
J,J：委繳戶身分確認不符
Z,Z：未交易或匯入失敗資料
ACH Bank_transaction_9,
01,01:存款不足
02,02:非委託用戶
03,03:已終止委託用戶
04,04:無此帳號
05,05:收受者統編錯誤
06,06:無此用戶號碼
07,07:用戶號碼不符
08,08:信用卡額度不足
09,09:未開卡
10,10:部分存款不足
11,11:超過扣款限額
12,12:信用卡未續卡
13,13:信用卡其他問題
22,22:帳戶已結清
23,23:靜止戶
24,24:凍結戶
25,25:帳戶存款遭法院強制執行
26,26:警示戶
27,27:該用戶已死亡
28,28:發動行申請停止入扣帳
91,91
99,99:其它
ACH Post_verification_11,
03,03	已終止代繳
06,06	凍結戶或警示戶
07,07	業務支票專戶
08,08	帳號錯誤
09,09	終止戶
10,10	身分證號不符
11,11	轉出戶
12,12	拒絕往來戶
13,13	無此用戶編號
14,14	用戶編號已存在
16,16	管制帳戶
17,17	掛失戶
18,18	異常交易帳戶
19,19	用戶編號非英數字元
91,91	規定期限內未有扣款
98,98	其他
ACH Post_verification_12,
1,1	局帳號不符
2,2	戶名不符
3,3	身分證號不符
4,4	印鑑不符
9,9	其他
ACH Post_transaction_15,
01,01	結存不足	
02,02	未申請代繳或用戶號碼錯誤	
03,03	已終止代繳	
04,04	劃撥劃號(G) 拒絶往來戶
06,06	凍結戶或警示戶	
07,07	劃撥劃號(G) 業務支票專戶
08,08	存簿帳號(P) 帳號錯誤、劃撥劃號(G) 無此帳號
09,09	帳戶已終止	
10,10	身分證號不符	
15,15	超過扣款上限	
18,18	檢號錯誤	
19,19	其他	
